         DBD   NAME=EMPDBD,ACCESS=(HDAM,OSAM)
         SEGM  NAME=EMPSEG,PARENT=0,BYTES=44
         FIELD NAME=(EMPID,SEQ,U),BYTES=6,START=1,TYPE=C
         FIELD NAME=EMPNAME,BYTES=30,START=7,TYPE=C
         FIELD NAME=EMPSTAT,BYTES=1,START=37,TYPE=C
         DBDGEN
         FINISH
         END
