DEFINE TRANSACTION(PYIQ) GROUP(PAYGRP) PROGRAM(PAYINQ)
DEFINE PROGRAM(PAYINQ) GROUP(PAYGRP) LANGUAGE(COBOL)
DEFINE FILE(EMPMAST) GROUP(PAYGRP) DSNAME(PROD.EMP.MASTER)
