//PAYRUN   JOB (ACCT),'PAYROLL',CLASS=A,MSGCLASS=X
//STEP010  EXEC PGM=PAYCALC
//EMPMAST  DD DSN=PROD.EMP.MASTER,DISP=SHR
//PAYOUT   DD DSN=PROD.PAY.OUT,DISP=(NEW,CATLG),
//            SPACE=(CYL,(5,1)),UNIT=SYSDA
//STEP020  EXEC PGM=IKJEFT01,COND=(4,LT,STEP010)
//SYSTSIN  DD *
  RUN PROGRAM(PAYRPT) PLAN(PAYPLAN)
/*
