//VSAMDEF  JOB (ACCT),'DEFINE VSAM + SORT',CLASS=A
//STEP010  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE CLUSTER (NAME(PROD.EMP.MASTER) -
    INDEXED -
    KEYS(6 0) -
    RECORDSIZE(80 80) -
    CYLINDERS(5 1))
/*
//STEP020  EXEC PGM=SORT
//SORTIN   DD DSN=PROD.PAY.OUT,DISP=SHR
//SORTOUT  DD DSN=PROD.PAY.SORTED,DISP=(NEW,CATLG),
//            SPACE=(CYL,(2,1)),UNIT=SYSDA
//SYSIN    DD *
  SORT FIELDS=(1,6,CH,A)
  INCLUDE COND=(43,1,CH,EQ,C'A')
/*
