//XFERJOB  JOB (ACCT),'SEND PAY FILES',CLASS=A
//STEP010  EXEC PGM=DMBATCH,REGION=0M
//SYSIN    DD *
  SIGNON
  SUBMIT PROC=PAYSEND SNODE=BANKNODE1
    COPY FROM (DSN=PROD.PAY.OUT DISP=SHR) -
         TO   (DSN=BANK.PAY.IN DISP=RPL)
  SIGNOFF
/*
//STEP020  EXEC PGM=FTP
//SYSIN    DD *
  open sftp.vendorx.com
  user PAYUSER
  put 'PROD.PAY.RPT' payrpt.txt
  quit
/*
