PAYMAP   DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,STORAGE=AUTO,     X
               TIOAPFX=YES
PAYMAP   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
EMPID    DFHMDF POS=(3,10),LENGTH=6,ATTRB=(UNPROT,IC),                X
               INITIAL='______'
EMPNAME  DFHMDF POS=(5,10),LENGTH=30,ATTRB=(ASKIP,NORM)
GROSSPAY DFHMDF POS=(7,10),LENGTH=10,ATTRB=(ASKIP,NORM),PICOUT='ZZZZ9.99'
         DFHMSD TYPE=FINAL
         END
