FILE PAYFILE DD(PAYOUT)
  PAY-EMP-ID     1  6 A
  PAY-GROSS      7  5 P 2
  PAY-STATUS    12  1 A
JOB INPUT PAYFILE NAME PAYLIST
  IF PAY-STATUS EQ 'H'
    PRINT PAYRPT01
  END-IF
REPORT PAYRPT01 LINESIZE 80
  TITLE 01 'HIGH-PAY EMPLOYEES  (PROD.PAY.OUT)'
  LINE 01 PAY-EMP-ID PAY-GROSS PAY-STATUS
